CAN-USB Interface 

CANUSB ASCII Commands V1.1:

Note: All commands to the CANUSB must end with [CR] (Ascii=13) and
they are CASE sensitive.

Sn[CR] Setup with standard CAN bit-rates where n is 0-8.
This command is only active if the CAN channel is closed.
S0 Setup 10Kbit
S1 Setup 20Kbit
S2 Setup 50Kbit
S3 Setup 100Kbit
S4 Setup 125Kbit
S5 Setup 250Kbit
S6 Setup 500Kbit
S7 Setup 800Kbit
S8 Setup 1Mbit
Example: S4[CR]
Setup CAN to 125Kbit.
Returns: CR (Ascii 13) for OK or BELL (Ascii 7) for ERROR.

sxxyy[CR] Setup with BTR0/BTR1 CAN bit-rates where xx and yy is a hex
value. This command is only active if the CAN channel is closed.
Emulate SJA1000.
xx BTR0 value in hex
yy BTR1 value in hex
Example: s031C[CR]
Returns: CR (Ascii 13) for OK or BELL (Ascii 7) for ERROR.


O[CR] Open the CAN channel.
This command is only active if the CAN channel is closed and
has been set up prior with either the S or s command (i.e. initiated).
Example: O[CR]
Open the channel
Returns: CR (Ascii 13) for OK or BELL (Ascii 7) for ERROR.


C[CR] Close the CAN channel.
This command is only active if the CAN channel is open.
Example: C[CR]
Close the channel
Returns: CR (Ascii 13) for OK or BELL (Ascii 7) for ERROR.


tiiildd...[CR] Transmit a standard (11bit) CAN frame.
This command is only active if the CAN channel is open.
iii Identifier in hex (000-7FF)
l Data length (0-8)
dd Byte value in hex (00-FF). Numbers of dd pairs
must match the data length, otherwise an error
occur.
Example 1: t10021133[CR]
Sends an 11bit CAN frame with ID=0x100, 2 bytes
with the value 0x11 and 0x33.
Example 2: t0200[CR]
Sends an 11bit CAN frame with ID=0x20 & 0 bytes.
Returns: z[CR] for OK or BELL (Ascii 7) for ERROR.

Tiiiiiiiildd...[CR] Transmit an extended (29bit) CAN frame.
This command is only active if the CAN channel is open.
iiiiiiii Identifier in hex (00000000-1FFFFFFF)
l Data length (0-8)
dd Byte value in hex (00-FF). Numbers of dd pairs
must match the data length, otherwise an error
occur.
Example 1: t0000010021133[CR]
Sends a 29bit CAN frame with ID=0x100, 2 bytes
with the value 0x11 and 0x33.
Returns: Z[CR] for OK or BELL (Ascii 7) for ERROR.


riiil[CR] Transmit an standard RTR (11bit) CAN frame.
This command is only active if the CANUSB is open in normal mode.
iii Identifier in hex (000-7FF)
l Data length (0-8)
Example 1: r1002[CR]
Sends an 11bit RTR CAN frame with ID=0x100
and DLC set to two (2 bytes).
Returns: z[CR] for OK or BELL (Ascii 7) for ERROR.
Riiiiiiiil[CR] Transmit an extended RTR (29bit) CAN frame.
This command is only active if the CANUSB is open in normal mode.
iiiiiiii Identifier in hex (00000000-1FFFFFFF)
l Data length (0-8)
Example 1: t000001002[CR]
Sends an 11bit RTR CAN frame with ID=0x100
and DLC set to two (2 bytes).
Returns: Z[CR] for OK or BELL (Ascii 7) for ERROR.

F[CR] (Unsupported) Read Status Flags.
This command is only active if the CAN channel is open.
Example 1: F[CR]
Read Status Flags.
Returns: An F with 2 bytes BCD hex value plus CR (Ascii 13)
for OK. If CAN channel isn't open it returns BELL
(Ascii 7). This command also clear the RED Error
LED. See availible errors below. E.g. F01[CR]


Mxxxxxxxx[CR] (Unsupported) Sets Acceptance Code Register 
This command is only active if the CAN channel is initiated and
not opened.
xxxxxxxx Acceptance Code in hex with LSB first,
AC0, AC1, AC2 & AC3.
For more info, see Philips SJA1000 datasheet.
Example: M00000000[CR]
Set Acceptance Code to 0x00000000
This is default when power on, i.e. receive all frames.
Returns: CR (Ascii 13) for OK or BELL (Ascii 7) for ERROR.

mxxxxxxxx[CR] (Unsupported) Sets Acceptance Mask Register 
This command is only active if the CAN channel is initiated and
not opened.
xxxxxxxx Acceptance Mask in hex with LSB first,
AM0, AM1, AM2 & AM3.
For more info, see Philips SJA1000 datasheet.
Example: mFFFFFFFF[CR]
Set Acceptance Mask to 0xFFFFFFFF
This is default when power on, i.e. receive all frames.
Returns: CR (Ascii 13) for OK or BELL (Ascii 7) for ERROR.
Setting Acceptance Code and Mask registers
The Acceptance Code Register and the Acceptance Mask Register works together and they can
filter out 2 groups of messages. For more information on how this work, look in the SJA1000
datasheet. In 11bit ID_s it is possible to filter out a single ID this way, but in 29bit ID's it is only
possible to filter out a group of ID's. 


V[CR] Get Version number of both CANUSB hardware and software
This command is active always.
Example: V[CR]
Get Version numbers
Returns: V and a 2 bytes BCD value for hardware version and
a 2 byte BCD value for software version plus
CR (Ascii 13) for OK. E.g. V1013[CR]

N[CR] Get Serial number of the CANUSB adapter.
This command is active always.
Example: N[CR]
Get Serial number
Returns: N and a 4 bytes value for serial number plus
CR (Ascii 13) for OK. E.g. NA123[CR]
Note that the serial number can have both numerical
and alfa numerical values in it. 

Zn[CR] Sets Time Stamp ON/OFF for received frames only.
This command is only active if the CAN channel is closed.
Setting it to ON, will add 4 bytes sent out from CANUSB with the 
A and P command or when the Auto Poll/Send feature is enabled.
When using Time Stamp each message gets a time in milliseconds
when it was received into the CANUSB, this can be used for real
time applications for e.g. knowing time inbetween messages etc.
Note however by using this feature you maybe will decrease
bandwith on the CANUSB, since it adds 4 bytes to each message
being sent (specially on VCP drivers).
If the Time Stamp is OFF, the incomming frames looks like this:
t10021133[CR] (a standard frame with ID=0x100 & 2 bytes)
If the Time Stamp is ON, the incomming frames looks like this:
t100211334D67[CR] (a standard frame with ID=0x100 & 2 bytes)
Note the last 4 bytes 0x4D67, which is a Time Stamp for this
specific message in milliseconds (and of course in hex). The timer
in the CANUSB starts at zero 0x0000 and goes up to 0xEA5F before
it loop arround and get's back to 0x0000. This corresponds to exact
60,000mS (i.e. 1 minute which will be more than enough in most
systems).

Example 1: Z0[CR]
Turn OFF the Time Stamp feature (default).
Example 2: Z1[CR]
Turn ON the Time Stamp feature.
Returns: CR (Ascii 13) for OK or BELL (Ascii 7) for ERROR.
